codecuellar/stm32-home-security-system-utn-frt/AFP_5_TDII_2024/AFP_5_TDII_2024/Drivers/API/Src/API_i2c.c
/*
 * API_i2c.c
 *
 *  Created on: Feb 8, 2025
 *      Author: windows10
 */

#include "API_i2c.h"
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal_i2c.h"  // Incluir el archivo de cabecera de I2C
#include "stm32f4xx_hal_dma.h"  // Incluir el archivo de cabecera de DMA
#include <string.h>
#include <stdlib.h>
#include "API_System.h"

I2C_HandleTypeDef hi2c1;
DMA_HandleTypeDef hdma_i2c1_rx;

/* Inicialización de I2C1 */
void I2C1_Init(void) {
    hi2c1.Instance = I2C1;
    hi2c1.Init.ClockSpeed = 100000;  // Velocidad estándar de 100 kHz
    hi2c1.Init.DutyCycle = I2C_DUTYCYCLE_2;
    hi2c1.Init.OwnAddress1 = 0;
    hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
    hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
    hi2c1.Init.OwnAddress2 = 0;
    hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
    hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;

    if (HAL_I2C_Init(&hi2c1) != HAL_OK) {
        Error_Handler();
    }
}

/* Configuración de los pines GPIO y del periférico I2C */
void HAL_I2C_MspInit(I2C_HandleTypeDef* i2cHandle) {
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    if (i2cHandle->Instance == I2C1) {
        /* Habilitar reloj de GPIOB */
        __HAL_RCC_GPIOB_CLK_ENABLE();

        /* Configurar PB6 (SCL) y PB7 (SDA) en modo I2C */
        GPIO_InitStruct.Pin = GPIO_PIN_6 | GPIO_PIN_7;
        GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
        GPIO_InitStruct.Pull = GPIO_PULLUP;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
        GPIO_InitStruct.Alternate = GPIO_AF4_I2C1;
        HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

        /* Habilitar reloj de I2C1 */
        __HAL_RCC_I2C1_CLK_ENABLE();

        /* Configuración del DMA para recepción I2C1 */
        __HAL_RCC_DMA2_CLK_ENABLE();  // Adaptado para F429ZI

        hdma_i2c1_rx.Instance = DMA2_Stream0;  // Cambio a DMA2 para F429ZI
        hdma_i2c1_rx.Init.Channel = DMA_CHANNEL_1;
        hdma_i2c1_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
        hdma_i2c1_rx.Init.PeriphInc = DMA_PINC_DISABLE;
        hdma_i2c1_rx.Init.MemInc = DMA_MINC_ENABLE;
        hdma_i2c1_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
        hdma_i2c1_rx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
        hdma_i2c1_rx.Init.Mode = DMA_NORMAL;
        hdma_i2c1_rx.Init.Priority = DMA_PRIORITY_LOW;
        hdma_i2c1_rx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;

        if (HAL_DMA_Init(&hdma_i2c1_rx) != HAL_OK) {
            Error_Handler();
        }

        __HAL_LINKDMA(i2cHandle, hdmarx, hdma_i2c1_rx);

        /* Configuración de interrupciones I2C1 */
        HAL_NVIC_SetPriority(I2C1_EV_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(I2C1_EV_IRQn);
    }
}

/* De-inicialización de I2C1 */
void HAL_I2C_MspDeInit(I2C_HandleTypeDef* i2cHandle) {
    if (i2cHandle->Instance == I2C1) {
        /* Deshabilitar el reloj de I2C1 */
        __HAL_RCC_I2C1_CLK_DISABLE();

        /* Reset de pines GPIO */
        HAL_GPIO_DeInit(GPIOB, GPIO_PIN_6 | GPIO_PIN_7);

        /* Deshabilitar DMA */
        HAL_DMA_DeInit(i2cHandle->hdmarx);

        /* Deshabilitar interrupciones */
        HAL_NVIC_DisableIRQ(I2C1_EV_IRQn);
    }
}
